configuration.el

(display-time-mode t)

;; Time format
(customize-set-variable 'display-time-string-forms
                        '((propertize (concat dayname
                                              " " 12-hours ":" minutes " " (upcase am-pm))
                                      'help-echo (format-time-string "%a, %b %e %Y" now))))

;; Update display-time-string
(display-time-update)

(use-package telephone-line
  :config
  (setq telephone-line-primary-left-separator 'telephone-line-utf-abs-left
        telephone-line-secondary-left-separator 'telephone-line-utf-abs-hollow-left
        telephone-line-primary-right-separator 'telephone-line-utf-abs-right
        telephone-line-secondary-right-separator 'telephone-line-utf-abs-hollow-right)
  (setq telephone-line-height 24
        telephone-line-evil-use-short-tag t)

  (setq telephone-line-lhs
        '((evil   . (telephone-line-evil-tag-segment))
          (accent . (telephone-line-airline-position-segment
                     telephone-line-process-segment))
          (nil    . (telephone-line-minor-mode-segment
                     telephone-line-buffer-segment))))
  (setq telephone-line-rhs
        '((nil    . (telephone-line-misc-info-segment))
          (evil   . (telephone-line-vc-segment))
          (accent . (telephone-line-major-mode-segment
                     telephone-line-flycheck-segment))))

  (telephone-line-mode t))

;; ;; Remove display-time-string from global-mode-string
;; (setq global-mode-string (delq 'display-time-string global-mode-string))

;; ;; Remove battery-mode-line-string from global-mode-string
;; (setq global-mode-string (delq 'battery-mode-line-string global-mode-string))

;; (defun *-mode-line-fill (reserve)
;;   "Return empty space using FACE and leaving RESERVE space on the right."
;;   (unless reserve
;;     (setq reserve 20))
;;   (when (and window-system
;;              (eq 'right (get-scroll-bar-mode)))
;;     (setq reserve (- reserve 3)))
;;   (propertize " "
;;               'display `((space :align-to (- (+ right right-fringe right-margin), reserve)))))

;; (setq-default mode-line-format
;;               '("%e"
;;                 mode-line-front-space
;;                 mode-line-client
;;                 mode-line-remote
;;                 mode-line-mule-info
;;                 mode-line-modified
;;                 "  "
;;                 ;; Buffer name
;;                 (:propertize mode-line-buffer-identification
;;                              face font-lock-builtin-face)
;;                 "  "
;;                 ;; Position
;;                 "%p (%l,%c)"
;;                 "  "
;;                 ;; Mode, recursive editing, and narrowing information
;;                 "("
;;                 (:propertize "%["
;;                              face font-lock-warning-face)
;;                 mode-name
;;                 (:propertize "%]"
;;                              face font-lock-warning-face)
;;                 (:eval (if (buffer-narrowed-p)
;;                            (concat " "
;;                                    (propertize "Narrow"
;;                                                'face 'font-lock-warning-face))))
;;                 ")"
;;                 ;; Version control
;;                 (:eval (when vc-mode
;;                          (concat " "
;;                                  vc-mode)))
;;                 ;; Miscellaneous information
;;                 "  "
;;                 mode-line-misc-info
;;                 (:eval (*-mode-line-fill (+ (length battery-mode-line-string)
;;                                             1
;;                                             (length display-time-string))))
;;                 battery-mode-line-string
;;                 " "
;;                 display-time-string
;;                 mode-line-end-spaces))

;; (use-package all-the-icons
;;   :demand
;;   :init
;;   (progn (defun -custom-modeline-github-vc ()
;;            (let ((branch (mapconcat 'concat (cdr (split-string vc-mode "[:-]")) "-")))
;;              (concat
;;               (propertize (format " %s" (all-the-icons-octicon "git-branch"))
;;                           'face `(:height 1 :family ,(all-the-icons-octicon-family))
;;                           'display '(raise 0))
;;               (propertize (format " %s" branch))
;;               (propertize "  "))))

;;          (defun -custom-modeline-svn-vc ()
;;            (let ((revision (cadr (split-string vc-mode "-"))))
;;              (concat
;;               (propertize (format " %s" (all-the-icons-faicon "cloud"))
;;                           'face `(:height 1)
;;                           'display '(raise 0))
;;               (propertize (format " %s" revision) 'face `(:height 0.9)))))

;;          (defvar mode-line-my-vc
;;            '(:propertize
;;              (:eval (when vc-mode
;;                       (cond
;;                        ((string-match "Git[:-]" vc-mode) (-custom-modeline-github-vc))
;;                        ((string-match "SVN-" vc-mode) (-custom-modeline-svn-vc))
;;                        (t (format "%s" vc-mode)))))
;;              face mode-line-directory)
;;            "Formats the current directory's git information in the modeline."))
;;   :config
;;   (progn
;;     (setq-default mode-line-format
;;                   (list
;;                    "("
;;                    "%02l" "," "%02c"
;;                    ") "
;;                    mode-line-front-space
;;                    " "
;;                    mode-line-mule-info
;;                    mode-line-modified
;;                    mode-line-frame-identification
;;                    mode-line-buffer-identification
;;                    " %6 "
;;                    mode-line-modes
;;                    mode-line-my-vc
;;                    '("  " battery-mode-line-string "  " display-time-string)
;;                    ))
;;     (concat evil-mode-line-tag)))

(use-package diminish
    :ensure t
    :init
    (diminish 'undo-tree-mode)
    (diminish 'auto-revert-mode)
    (diminish 'global-auto-revert-mode)
    (diminish 'flyspell-mode))

(setq display-time-default-load-average nil)

(setq visible-bell nil)
(setq ring-bell-function 'ignore)

(defun my-terminal-visible-bell ()
   "A friendlier visual bell effect."
   (invert-face 'mode-line)
   (run-with-timer 0.1 nil 'invert-face 'mode-line))

 (setq visible-bell nil
       ring-bell-function 'my-terminal-visible-bell)

(when (window-system)
